{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "_minus_scalar", 
      "name": "_minusscalar26", 
      "attrs": {"scalar": "0.5"}, 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar13", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[1, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "init1_(1,16,3,32)_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "init1_(1,16,3,32)_conv", 
      "attrs": {
        "kernel": "(16, 1)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "sum13", 
      "attrs": {"axis": "2"}, 
      "inputs": [[4, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh338", 
      "inputs": [[5, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "initialConvs_0_lambda_(1,32,1)_weight", 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu338", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1"
      }, 
      "inputs": [[7, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar403", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul338", 
      "inputs": [[6, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "init2_(3,32,64)_weight", 
      "inputs": []
    }, 
    {
      "op": "reverse", 
      "name": "flip325", 
      "attrs": {"axis": "2"}, 
      "inputs": [[11, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add325", 
      "inputs": [[11, 0, 0], [12, 0, 0]]
    }, 
    {
      "op": "_div_scalar", 
      "name": "_divscalar325", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[13, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "init2_(3,32,64)_conv", 
      "attrs": {
        "kernel": "3", 
        "no_bias": "1", 
        "num_filter": "64", 
        "pad": "1", 
        "stride": "1"
      }, 
      "inputs": [[10, 0, 0], [14, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh339", 
      "inputs": [[15, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "initialConvs_1_lambda_(1,64,1)_weight", 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu339", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1"
      }, 
      "inputs": [[17, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar404", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[18, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul339", 
      "inputs": [[16, 0, 0], [19, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "[3]_3.1_s(3,64,128)_weight", 
      "inputs": []
    }, 
    {
      "op": "reverse", 
      "name": "flip326", 
      "attrs": {"axis": "2"}, 
      "inputs": [[21, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add326", 
      "inputs": [[21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "_div_scalar", 
      "name": "_divscalar326", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[23, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "[3]_3.1_s(3,64,128)_conv", 
      "attrs": {
        "dilate": "1", 
        "kernel": "3", 
        "no_bias": "1", 
        "num_filter": "128", 
        "pad": "1", 
        "stride": "2"
      }, 
      "inputs": [[20, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh340", 
      "inputs": [[25, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "3.1_s_lambda_(1,128,1)_weight", 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu340", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1"
      }, 
      "inputs": [[27, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar405", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[28, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul340", 
      "inputs": [[26, 0, 0], [29, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "[3]_3.2_s(3,128,128)_weight", 
      "inputs": []
    }, 
    {
      "op": "reverse", 
      "name": "flip327", 
      "attrs": {"axis": "2"}, 
      "inputs": [[31, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add327", 
      "inputs": [[31, 0, 0], [32, 0, 0]]
    }, 
    {
      "op": "_div_scalar", 
      "name": "_divscalar327", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[33, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "[3]_3.2_s(3,128,128)_conv", 
      "attrs": {
        "dilate": "1", 
        "kernel": "3", 
        "no_bias": "1", 
        "num_filter": "128", 
        "pad": "1", 
        "stride": "1"
      }, 
      "inputs": [[30, 0, 0], [34, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh341", 
      "inputs": [[35, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "3.2_s_lambda_(1,128,1)_weight", 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu341", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1"
      }, 
      "inputs": [[37, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar406", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[38, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul341", 
      "inputs": [[36, 0, 0], [39, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "[1]_3_s(1,64,128)_weight", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "[1]_3_s(1,64,128)_project_conv", 
      "attrs": {
        "kernel": "1", 
        "no_bias": "1", 
        "num_filter": "128", 
        "pad": "0", 
        "stride": "1"
      }, 
      "inputs": [[20, 0, 0], [41, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling91", 
      "attrs": {
        "kernel": "3", 
        "pad": "1", 
        "pool_type": "avg", 
        "stride": "2"
      }, 
      "inputs": [[42, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "3_128_skip", 
      "inputs": [[40, 0, 0], [43, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "[3]_4.1_s(3,128,128)_weight", 
      "inputs": []
    }, 
    {
      "op": "reverse", 
      "name": "flip328", 
      "attrs": {"axis": "2"}, 
      "inputs": [[45, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add328", 
      "inputs": [[45, 0, 0], [46, 0, 0]]
    }, 
    {
      "op": "_div_scalar", 
      "name": "_divscalar328", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[47, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "[3]_4.1_s(3,128,128)_conv", 
      "attrs": {
        "dilate": "1", 
        "kernel": "3", 
        "no_bias": "1", 
        "num_filter": "128", 
        "pad": "1", 
        "stride": "1"
      }, 
      "inputs": [[44, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh342", 
      "inputs": [[49, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "4.1_s_lambda_(1,128,1)_weight", 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu342", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1"
      }, 
      "inputs": [[51, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar407", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[52, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul342", 
      "inputs": [[50, 0, 0], [53, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "[3]_4.2_s(3,128,128)_weight", 
      "inputs": []
    }, 
    {
      "op": "reverse", 
      "name": "flip329", 
      "attrs": {"axis": "2"}, 
      "inputs": [[55, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add329", 
      "inputs": [[55, 0, 0], [56, 0, 0]]
    }, 
    {
      "op": "_div_scalar", 
      "name": "_divscalar329", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[57, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "[3]_4.2_s(3,128,128)_conv", 
      "attrs": {
        "dilate": "1", 
        "kernel": "3", 
        "no_bias": "1", 
        "num_filter": "128", 
        "pad": "1", 
        "stride": "1"
      }, 
      "inputs": [[54, 0, 0], [58, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh343", 
      "inputs": [[59, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "4.2_s_lambda_(1,128,1)_weight", 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu343", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1"
      }, 
      "inputs": [[61, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar408", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[62, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul343", 
      "inputs": [[60, 0, 0], [63, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "4_128_skip", 
      "inputs": [[64, 0, 0], [44, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "[3]_5.1_s(3,128,128)_weight", 
      "inputs": []
    }, 
    {
      "op": "reverse", 
      "name": "flip330", 
      "attrs": {"axis": "2"}, 
      "inputs": [[66, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add330", 
      "inputs": [[66, 0, 0], [67, 0, 0]]
    }, 
    {
      "op": "_div_scalar", 
      "name": "_divscalar330", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[68, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "[3]_5.1_s(3,128,128)_conv", 
      "attrs": {
        "dilate": "1", 
        "kernel": "3", 
        "no_bias": "1", 
        "num_filter": "128", 
        "pad": "1", 
        "stride": "2"
      }, 
      "inputs": [[65, 0, 0], [69, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh344", 
      "inputs": [[70, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "5.1_s_lambda_(1,128,1)_weight", 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu344", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1"
      }, 
      "inputs": [[72, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar409", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[73, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul344", 
      "inputs": [[71, 0, 0], [74, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "[3]_5.2_s(3,128,128)_weight", 
      "inputs": []
    }, 
    {
      "op": "reverse", 
      "name": "flip331", 
      "attrs": {"axis": "2"}, 
      "inputs": [[76, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add331", 
      "inputs": [[76, 0, 0], [77, 0, 0]]
    }, 
    {
      "op": "_div_scalar", 
      "name": "_divscalar331", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[78, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "[3]_5.2_s(3,128,128)_conv", 
      "attrs": {
        "dilate": "1", 
        "kernel": "3", 
        "no_bias": "1", 
        "num_filter": "128", 
        "pad": "1", 
        "stride": "1"
      }, 
      "inputs": [[75, 0, 0], [79, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh345", 
      "inputs": [[80, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "5.2_s_lambda_(1,128,1)_weight", 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu345", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1"
      }, 
      "inputs": [[82, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar410", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[83, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul345", 
      "inputs": [[81, 0, 0], [84, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling92", 
      "attrs": {
        "kernel": "3", 
        "pad": "1", 
        "pool_type": "avg", 
        "stride": "2"
      }, 
      "inputs": [[65, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "5_128_skip", 
      "inputs": [[85, 0, 0], [86, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "[3]_6.1_s(3,128,128)_weight", 
      "inputs": []
    }, 
    {
      "op": "reverse", 
      "name": "flip332", 
      "attrs": {"axis": "2"}, 
      "inputs": [[88, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add332", 
      "inputs": [[88, 0, 0], [89, 0, 0]]
    }, 
    {
      "op": "_div_scalar", 
      "name": "_divscalar332", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[90, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "[3]_6.1_s(3,128,128)_conv", 
      "attrs": {
        "dilate": "1", 
        "kernel": "3", 
        "no_bias": "1", 
        "num_filter": "128", 
        "pad": "1", 
        "stride": "1"
      }, 
      "inputs": [[87, 0, 0], [91, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh346", 
      "inputs": [[92, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "6.1_s_lambda_(1,128,1)_weight", 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu346", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1"
      }, 
      "inputs": [[94, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar411", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[95, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul346", 
      "inputs": [[93, 0, 0], [96, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "[3]_6.2_s(3,128,128)_weight", 
      "inputs": []
    }, 
    {
      "op": "reverse", 
      "name": "flip333", 
      "attrs": {"axis": "2"}, 
      "inputs": [[98, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add333", 
      "inputs": [[98, 0, 0], [99, 0, 0]]
    }, 
    {
      "op": "_div_scalar", 
      "name": "_divscalar333", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[100, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "[3]_6.2_s(3,128,128)_conv", 
      "attrs": {
        "dilate": "1", 
        "kernel": "3", 
        "no_bias": "1", 
        "num_filter": "128", 
        "pad": "1", 
        "stride": "1"
      }, 
      "inputs": [[97, 0, 0], [101, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh347", 
      "inputs": [[102, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "6.2_s_lambda_(1,128,1)_weight", 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu347", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1"
      }, 
      "inputs": [[104, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar412", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[105, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul347", 
      "inputs": [[103, 0, 0], [106, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "6_128_skip", 
      "inputs": [[107, 0, 0], [87, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "[3]_7.1_s(3,128,128)_weight", 
      "inputs": []
    }, 
    {
      "op": "reverse", 
      "name": "flip334", 
      "attrs": {"axis": "2"}, 
      "inputs": [[109, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add334", 
      "inputs": [[109, 0, 0], [110, 0, 0]]
    }, 
    {
      "op": "_div_scalar", 
      "name": "_divscalar334", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[111, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "[3]_7.1_s(3,128,128)_conv", 
      "attrs": {
        "dilate": "1", 
        "kernel": "3", 
        "no_bias": "1", 
        "num_filter": "128", 
        "pad": "1", 
        "stride": "2"
      }, 
      "inputs": [[108, 0, 0], [112, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh348", 
      "inputs": [[113, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "7.1_s_lambda_(1,128,1)_weight", 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu348", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1"
      }, 
      "inputs": [[115, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar413", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[116, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul348", 
      "inputs": [[114, 0, 0], [117, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "[3]_7.2_s(3,128,128)_weight", 
      "inputs": []
    }, 
    {
      "op": "reverse", 
      "name": "flip335", 
      "attrs": {"axis": "2"}, 
      "inputs": [[119, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add335", 
      "inputs": [[119, 0, 0], [120, 0, 0]]
    }, 
    {
      "op": "_div_scalar", 
      "name": "_divscalar335", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[121, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "[3]_7.2_s(3,128,128)_conv", 
      "attrs": {
        "dilate": "1", 
        "kernel": "3", 
        "no_bias": "1", 
        "num_filter": "128", 
        "pad": "1", 
        "stride": "1"
      }, 
      "inputs": [[118, 0, 0], [122, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh349", 
      "inputs": [[123, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "7.2_s_lambda_(1,128,1)_weight", 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu349", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1"
      }, 
      "inputs": [[125, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar414", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[126, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul349", 
      "inputs": [[124, 0, 0], [127, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling93", 
      "attrs": {
        "kernel": "3", 
        "pad": "1", 
        "pool_type": "avg", 
        "stride": "2"
      }, 
      "inputs": [[108, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "7_128_skip", 
      "inputs": [[128, 0, 0], [129, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "[3]_8.1_s(3,128,128)_weight", 
      "inputs": []
    }, 
    {
      "op": "reverse", 
      "name": "flip336", 
      "attrs": {"axis": "2"}, 
      "inputs": [[131, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add336", 
      "inputs": [[131, 0, 0], [132, 0, 0]]
    }, 
    {
      "op": "_div_scalar", 
      "name": "_divscalar336", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[133, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "[3]_8.1_s(3,128,128)_conv", 
      "attrs": {
        "dilate": "1", 
        "kernel": "3", 
        "no_bias": "1", 
        "num_filter": "128", 
        "pad": "1", 
        "stride": "1"
      }, 
      "inputs": [[130, 0, 0], [134, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh350", 
      "inputs": [[135, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "8.1_s_lambda_(1,128,1)_weight", 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu350", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1"
      }, 
      "inputs": [[137, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar415", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[138, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul350", 
      "inputs": [[136, 0, 0], [139, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "[3]_8.2_s(3,128,128)_weight", 
      "inputs": []
    }, 
    {
      "op": "reverse", 
      "name": "flip337", 
      "attrs": {"axis": "2"}, 
      "inputs": [[141, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add337", 
      "inputs": [[141, 0, 0], [142, 0, 0]]
    }, 
    {
      "op": "_div_scalar", 
      "name": "_divscalar337", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[143, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "[3]_8.2_s(3,128,128)_conv", 
      "attrs": {
        "dilate": "1", 
        "kernel": "3", 
        "no_bias": "1", 
        "num_filter": "128", 
        "pad": "1", 
        "stride": "1"
      }, 
      "inputs": [[140, 0, 0], [144, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh351", 
      "inputs": [[145, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "8.2_s_lambda_(1,128,1)_weight", 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu351", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1"
      }, 
      "inputs": [[147, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar416", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[148, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul351", 
      "inputs": [[146, 0, 0], [149, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "8_128_skip", 
      "inputs": [[150, 0, 0], [130, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "[3]_9.1_s(3,128,128)_weight", 
      "inputs": []
    }, 
    {
      "op": "reverse", 
      "name": "flip338", 
      "attrs": {"axis": "2"}, 
      "inputs": [[152, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add338", 
      "inputs": [[152, 0, 0], [153, 0, 0]]
    }, 
    {
      "op": "_div_scalar", 
      "name": "_divscalar338", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[154, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "[3]_9.1_s(3,128,128)_conv", 
      "attrs": {
        "dilate": "1", 
        "kernel": "3", 
        "no_bias": "1", 
        "num_filter": "128", 
        "pad": "1", 
        "stride": "2"
      }, 
      "inputs": [[151, 0, 0], [155, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh352", 
      "inputs": [[156, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "9.1_s_lambda_(1,128,1)_weight", 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu352", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1"
      }, 
      "inputs": [[158, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar417", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[159, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul352", 
      "inputs": [[157, 0, 0], [160, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "[3]_9.2_s(3,128,128)_weight", 
      "inputs": []
    }, 
    {
      "op": "reverse", 
      "name": "flip339", 
      "attrs": {"axis": "2"}, 
      "inputs": [[162, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add339", 
      "inputs": [[162, 0, 0], [163, 0, 0]]
    }, 
    {
      "op": "_div_scalar", 
      "name": "_divscalar339", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[164, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "[3]_9.2_s(3,128,128)_conv", 
      "attrs": {
        "dilate": "1", 
        "kernel": "3", 
        "no_bias": "1", 
        "num_filter": "128", 
        "pad": "1", 
        "stride": "1"
      }, 
      "inputs": [[161, 0, 0], [165, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh353", 
      "inputs": [[166, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "9.2_s_lambda_(1,128,1)_weight", 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu353", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1"
      }, 
      "inputs": [[168, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar418", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[169, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul353", 
      "inputs": [[167, 0, 0], [170, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling94", 
      "attrs": {
        "kernel": "3", 
        "pad": "1", 
        "pool_type": "avg", 
        "stride": "2"
      }, 
      "inputs": [[151, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "9_128_skip", 
      "inputs": [[171, 0, 0], [172, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "[3]_10.1_s(3,128,128)_weight", 
      "inputs": []
    }, 
    {
      "op": "reverse", 
      "name": "flip340", 
      "attrs": {"axis": "2"}, 
      "inputs": [[174, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add340", 
      "inputs": [[174, 0, 0], [175, 0, 0]]
    }, 
    {
      "op": "_div_scalar", 
      "name": "_divscalar340", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[176, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "[3]_10.1_s(3,128,128)_conv", 
      "attrs": {
        "dilate": "1", 
        "kernel": "3", 
        "no_bias": "1", 
        "num_filter": "128", 
        "pad": "1", 
        "stride": "1"
      }, 
      "inputs": [[173, 0, 0], [177, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh354", 
      "inputs": [[178, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "10.1_s_lambda_(1,128,1)_weight", 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu354", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1"
      }, 
      "inputs": [[180, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar419", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[181, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul354", 
      "inputs": [[179, 0, 0], [182, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "[3]_10.2_s(3,128,128)_weight", 
      "inputs": []
    }, 
    {
      "op": "reverse", 
      "name": "flip341", 
      "attrs": {"axis": "2"}, 
      "inputs": [[184, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add341", 
      "inputs": [[184, 0, 0], [185, 0, 0]]
    }, 
    {
      "op": "_div_scalar", 
      "name": "_divscalar341", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[186, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "[3]_10.2_s(3,128,128)_conv", 
      "attrs": {
        "dilate": "1", 
        "kernel": "3", 
        "no_bias": "1", 
        "num_filter": "128", 
        "pad": "1", 
        "stride": "1"
      }, 
      "inputs": [[183, 0, 0], [187, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh355", 
      "inputs": [[188, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "10.2_s_lambda_(1,128,1)_weight", 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu355", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1"
      }, 
      "inputs": [[190, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar420", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[191, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul355", 
      "inputs": [[189, 0, 0], [192, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "10_128_skip", 
      "inputs": [[193, 0, 0], [173, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "[3]_11.1_s(3,128,128)_weight", 
      "inputs": []
    }, 
    {
      "op": "reverse", 
      "name": "flip342", 
      "attrs": {"axis": "2"}, 
      "inputs": [[195, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add342", 
      "inputs": [[195, 0, 0], [196, 0, 0]]
    }, 
    {
      "op": "_div_scalar", 
      "name": "_divscalar342", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[197, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "[3]_11.1_s(3,128,128)_conv", 
      "attrs": {
        "dilate": "1", 
        "kernel": "3", 
        "no_bias": "1", 
        "num_filter": "128", 
        "pad": "1", 
        "stride": "2"
      }, 
      "inputs": [[194, 0, 0], [198, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh356", 
      "inputs": [[199, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "11.1_s_lambda_(1,128,1)_weight", 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu356", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1"
      }, 
      "inputs": [[201, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar421", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[202, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul356", 
      "inputs": [[200, 0, 0], [203, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "[3]_11.2_s(3,128,128)_weight", 
      "inputs": []
    }, 
    {
      "op": "reverse", 
      "name": "flip343", 
      "attrs": {"axis": "2"}, 
      "inputs": [[205, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add343", 
      "inputs": [[205, 0, 0], [206, 0, 0]]
    }, 
    {
      "op": "_div_scalar", 
      "name": "_divscalar343", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[207, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "[3]_11.2_s(3,128,128)_conv", 
      "attrs": {
        "dilate": "1", 
        "kernel": "3", 
        "no_bias": "1", 
        "num_filter": "128", 
        "pad": "1", 
        "stride": "1"
      }, 
      "inputs": [[204, 0, 0], [208, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh357", 
      "inputs": [[209, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "11.2_s_lambda_(1,128,1)_weight", 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu357", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1"
      }, 
      "inputs": [[211, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar422", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[212, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul357", 
      "inputs": [[210, 0, 0], [213, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling95", 
      "attrs": {
        "kernel": "3", 
        "pad": "1", 
        "pool_type": "avg", 
        "stride": "2"
      }, 
      "inputs": [[194, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "11_128_skip", 
      "inputs": [[214, 0, 0], [215, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "[3]_12.1_s(3,128,128)_weight", 
      "inputs": []
    }, 
    {
      "op": "reverse", 
      "name": "flip344", 
      "attrs": {"axis": "2"}, 
      "inputs": [[217, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add344", 
      "inputs": [[217, 0, 0], [218, 0, 0]]
    }, 
    {
      "op": "_div_scalar", 
      "name": "_divscalar344", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[219, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "[3]_12.1_s(3,128,128)_conv", 
      "attrs": {
        "dilate": "1", 
        "kernel": "3", 
        "no_bias": "1", 
        "num_filter": "128", 
        "pad": "1", 
        "stride": "1"
      }, 
      "inputs": [[216, 0, 0], [220, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh358", 
      "inputs": [[221, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "12.1_s_lambda_(1,128,1)_weight", 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu358", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1"
      }, 
      "inputs": [[223, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar423", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[224, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul358", 
      "inputs": [[222, 0, 0], [225, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "[3]_12.2_s(3,128,128)_weight", 
      "inputs": []
    }, 
    {
      "op": "reverse", 
      "name": "flip345", 
      "attrs": {"axis": "2"}, 
      "inputs": [[227, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add345", 
      "inputs": [[227, 0, 0], [228, 0, 0]]
    }, 
    {
      "op": "_div_scalar", 
      "name": "_divscalar345", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[229, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "[3]_12.2_s(3,128,128)_conv", 
      "attrs": {
        "dilate": "1", 
        "kernel": "3", 
        "no_bias": "1", 
        "num_filter": "128", 
        "pad": "1", 
        "stride": "1"
      }, 
      "inputs": [[226, 0, 0], [230, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh359", 
      "inputs": [[231, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "12.2_s_lambda_(1,128,1)_weight", 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu359", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1"
      }, 
      "inputs": [[233, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar424", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[234, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul359", 
      "inputs": [[232, 0, 0], [235, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "12_128_skip", 
      "inputs": [[236, 0, 0], [216, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "[3]_13.1_s(3,128,128)_weight", 
      "inputs": []
    }, 
    {
      "op": "reverse", 
      "name": "flip346", 
      "attrs": {"axis": "2"}, 
      "inputs": [[238, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add346", 
      "inputs": [[238, 0, 0], [239, 0, 0]]
    }, 
    {
      "op": "_div_scalar", 
      "name": "_divscalar346", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[240, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "[3]_13.1_s(3,128,128)_conv", 
      "attrs": {
        "dilate": "1", 
        "kernel": "3", 
        "no_bias": "1", 
        "num_filter": "128", 
        "pad": "1", 
        "stride": "2"
      }, 
      "inputs": [[237, 0, 0], [241, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh360", 
      "inputs": [[242, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "13.1_s_lambda_(1,128,1)_weight", 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu360", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1"
      }, 
      "inputs": [[244, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar425", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[245, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul360", 
      "inputs": [[243, 0, 0], [246, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "[3]_13.2_s(3,128,128)_weight", 
      "inputs": []
    }, 
    {
      "op": "reverse", 
      "name": "flip347", 
      "attrs": {"axis": "2"}, 
      "inputs": [[248, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add347", 
      "inputs": [[248, 0, 0], [249, 0, 0]]
    }, 
    {
      "op": "_div_scalar", 
      "name": "_divscalar347", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[250, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "[3]_13.2_s(3,128,128)_conv", 
      "attrs": {
        "dilate": "1", 
        "kernel": "3", 
        "no_bias": "1", 
        "num_filter": "128", 
        "pad": "1", 
        "stride": "1"
      }, 
      "inputs": [[247, 0, 0], [251, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh361", 
      "inputs": [[252, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "13.2_s_lambda_(1,128,1)_weight", 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu361", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1"
      }, 
      "inputs": [[254, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar426", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[255, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul361", 
      "inputs": [[253, 0, 0], [256, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling96", 
      "attrs": {
        "kernel": "3", 
        "pad": "1", 
        "pool_type": "avg", 
        "stride": "2"
      }, 
      "inputs": [[237, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "13_128_skip", 
      "inputs": [[257, 0, 0], [258, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "[3]_14.1_s(3,128,128)_weight", 
      "inputs": []
    }, 
    {
      "op": "reverse", 
      "name": "flip348", 
      "attrs": {"axis": "2"}, 
      "inputs": [[260, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add348", 
      "inputs": [[260, 0, 0], [261, 0, 0]]
    }, 
    {
      "op": "_div_scalar", 
      "name": "_divscalar348", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[262, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "[3]_14.1_s(3,128,128)_conv", 
      "attrs": {
        "dilate": "1", 
        "kernel": "3", 
        "no_bias": "1", 
        "num_filter": "128", 
        "pad": "1", 
        "stride": "1"
      }, 
      "inputs": [[259, 0, 0], [263, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh362", 
      "inputs": [[264, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "14.1_s_lambda_(1,128,1)_weight", 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu362", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1"
      }, 
      "inputs": [[266, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar427", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[267, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul362", 
      "inputs": [[265, 0, 0], [268, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "[3]_14.2_s(3,128,128)_weight", 
      "inputs": []
    }, 
    {
      "op": "reverse", 
      "name": "flip349", 
      "attrs": {"axis": "2"}, 
      "inputs": [[270, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add349", 
      "inputs": [[270, 0, 0], [271, 0, 0]]
    }, 
    {
      "op": "_div_scalar", 
      "name": "_divscalar349", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[272, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "[3]_14.2_s(3,128,128)_conv", 
      "attrs": {
        "dilate": "1", 
        "kernel": "3", 
        "no_bias": "1", 
        "num_filter": "128", 
        "pad": "1", 
        "stride": "1"
      }, 
      "inputs": [[269, 0, 0], [273, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh363", 
      "inputs": [[274, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "14.2_s_lambda_(1,128,1)_weight", 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu363", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1"
      }, 
      "inputs": [[276, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar428", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[277, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul363", 
      "inputs": [[275, 0, 0], [278, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "14_128_skip", 
      "inputs": [[279, 0, 0], [259, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "nin2_weight", 
      "attrs": {
        "kernel": "1", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "0", 
        "stride": "1"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "nin2", 
      "attrs": {
        "kernel": "1", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "0", 
        "stride": "1"
      }, 
      "inputs": [[280, 0, 0], [281, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling97", 
      "attrs": {
        "global_pool": "1", 
        "kernel": "1", 
        "pool_type": "avg", 
        "stride": "1"
      }, 
      "inputs": [[282, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten13", 
      "inputs": [[283, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "anchor_gamma", 
      "inputs": []
    }, 
    {
      "op": "_minus_scalar", 
      "name": "_minusscalar27", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[285, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation26", 
      "attrs": {"act_type": "softsign"}, 
      "inputs": [[286, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar429", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[287, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "anchor_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "anchor_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "anchor_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "anchor", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": [[284, 0, 0], [288, 0, 0], [289, 0, 0], [290, 0, 1], [291, 0, 1]]
    }
  ], 
  "arg_nodes": [
    0, 
    3, 
    7, 
    11, 
    17, 
    21, 
    27, 
    31, 
    37, 
    41, 
    45, 
    51, 
    55, 
    61, 
    66, 
    72, 
    76, 
    82, 
    88, 
    94, 
    98, 
    104, 
    109, 
    115, 
    119, 
    125, 
    131, 
    137, 
    141, 
    147, 
    152, 
    158, 
    162, 
    168, 
    174, 
    180, 
    184, 
    190, 
    195, 
    201, 
    205, 
    211, 
    217, 
    223, 
    227, 
    233, 
    238, 
    244, 
    248, 
    254, 
    260, 
    266, 
    270, 
    276, 
    281, 
    285, 
    289, 
    290, 
    291
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42, 
    43, 
    44, 
    45, 
    46, 
    47, 
    48, 
    49, 
    50, 
    51, 
    52, 
    53, 
    54, 
    55, 
    56, 
    57, 
    58, 
    59, 
    60, 
    61, 
    62, 
    63, 
    64, 
    65, 
    66, 
    67, 
    68, 
    69, 
    70, 
    71, 
    72, 
    73, 
    74, 
    75, 
    76, 
    77, 
    78, 
    79, 
    80, 
    81, 
    82, 
    83, 
    84, 
    85, 
    86, 
    87, 
    88, 
    89, 
    90, 
    91, 
    92, 
    93, 
    94, 
    95, 
    96, 
    97, 
    98, 
    99, 
    100, 
    101, 
    102, 
    103, 
    104, 
    105, 
    106, 
    107, 
    108, 
    109, 
    110, 
    111, 
    112, 
    113, 
    114, 
    115, 
    116, 
    117, 
    118, 
    119, 
    120, 
    121, 
    122, 
    123, 
    124, 
    125, 
    126, 
    127, 
    128, 
    129, 
    130, 
    131, 
    132, 
    133, 
    134, 
    135, 
    136, 
    137, 
    138, 
    139, 
    140, 
    141, 
    142, 
    143, 
    144, 
    145, 
    146, 
    147, 
    148, 
    149, 
    150, 
    151, 
    152, 
    153, 
    154, 
    155, 
    156, 
    157, 
    158, 
    159, 
    160, 
    161, 
    162, 
    163, 
    164, 
    165, 
    166, 
    167, 
    168, 
    169, 
    170, 
    171, 
    172, 
    173, 
    174, 
    175, 
    176, 
    177, 
    178, 
    179, 
    180, 
    181, 
    182, 
    183, 
    184, 
    185, 
    186, 
    187, 
    188, 
    189, 
    190, 
    191, 
    192, 
    193, 
    194, 
    195, 
    196, 
    197, 
    198, 
    199, 
    200, 
    201, 
    202, 
    203, 
    204, 
    205, 
    206, 
    207, 
    208, 
    209, 
    210, 
    211, 
    212, 
    213, 
    214, 
    215, 
    216, 
    217, 
    218, 
    219, 
    220, 
    221, 
    222, 
    223, 
    224, 
    225, 
    226, 
    227, 
    228, 
    229, 
    230, 
    231, 
    232, 
    233, 
    234, 
    235, 
    236, 
    237, 
    238, 
    239, 
    240, 
    241, 
    242, 
    243, 
    244, 
    245, 
    246, 
    247, 
    248, 
    249, 
    250, 
    251, 
    252, 
    253, 
    254, 
    255, 
    256, 
    257, 
    258, 
    259, 
    260, 
    261, 
    262, 
    263, 
    264, 
    265, 
    266, 
    267, 
    268, 
    269, 
    270, 
    271, 
    272, 
    273, 
    274, 
    275, 
    276, 
    277, 
    278, 
    279, 
    280, 
    281, 
    282, 
    283, 
    284, 
    285, 
    286, 
    287, 
    288, 
    289, 
    290, 
    291, 
    292, 
    295
  ], 
  "heads": [[292, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10600]}
}