{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "_minus_scalar", 
      "name": "_minusscalar3", 
      "attrs": {"scalar": "0.5"}, 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar267", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[1, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad18", 
      "attrs": {
        "mode": "edge", 
        "pad_width": "(0, 0, 0, 0, 2, 2, 2, 2)"
      }, 
      "inputs": [[2, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "radius_5x5", 
      "inputs": []
    }, 
    {
      "op": "tile", 
      "name": "tile336", 
      "attrs": {"reps": "(4, 3, 1, 1)"}, 
      "inputs": [[4, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad424", 
      "inputs": [[5, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->1_[5,5]_initialConvs_0_Ord0_radial_(1,1,3,4)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul283", 
      "inputs": [[6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->1_[5,5]_initialConvs_0_Ord0_radial_(1,1,3,4)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add265", 
      "inputs": [[8, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar268", 
      "attrs": {"scalar": "100"}, 
      "inputs": [[10, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh159", 
      "inputs": [[11, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul159", 
      "inputs": [[10, 0, 0], [12, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "sort_ins1_out1_Re_assm_[5,5]_initialConvs_0", 
      "attrs": {
        "dim": "1", 
        "num_args": "1"
      }, 
      "inputs": [[13, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "theta_5x5", 
      "inputs": []
    }, 
    {
      "op": "tile", 
      "name": "tile339", 
      "attrs": {"reps": "(4, 3, 1, 1)"}, 
      "inputs": [[15, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad427", 
      "inputs": [[16, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar270", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[17, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile338", 
      "attrs": {"reps": "(4, 3, 1, 1)"}, 
      "inputs": [[4, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad426", 
      "inputs": [[19, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->2_[5,5]_initialConvs_0_Ord1_angular_(1,1,3,4)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul285", 
      "inputs": [[20, 0, 0], [21, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->2_[5,5]_initialConvs_0_Ord1_angular_(1,1,3,4)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add267", 
      "inputs": [[22, 0, 0], [23, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add124", 
      "inputs": [[18, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "cos", 
      "name": "cos106", 
      "inputs": [[25, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like106", 
      "inputs": [[20, 0, 0]]
    }, 
    {
      "op": "broadcast_lesser", 
      "name": "broadcast_lesser106", 
      "inputs": [[20, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad428", 
      "inputs": [[28, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul443", 
      "inputs": [[26, 0, 0], [29, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->2_[5,5]_initialConvs_0_Ord1_radial_(1,1,3,4)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul284", 
      "inputs": [[20, 0, 0], [31, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->2_[5,5]_initialConvs_0_Ord1_radial_(1,1,3,4)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add266", 
      "inputs": [[32, 0, 0], [33, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar269", 
      "attrs": {"scalar": "100"}, 
      "inputs": [[34, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh160", 
      "inputs": [[35, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul160", 
      "inputs": [[34, 0, 0], [36, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul445", 
      "inputs": [[30, 0, 0], [37, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "sort_ins1_out2_Re_assm_[5,5]_initialConvs_0", 
      "attrs": {
        "dim": "1", 
        "num_args": "1"
      }, 
      "inputs": [[38, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile341", 
      "attrs": {"reps": "(4, 3, 1, 1)"}, 
      "inputs": [[15, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad430", 
      "inputs": [[40, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar272", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[41, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile340", 
      "attrs": {"reps": "(4, 3, 1, 1)"}, 
      "inputs": [[4, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad429", 
      "inputs": [[43, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->3_[5,5]_initialConvs_0_Ord2_angular_(1,1,3,4)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul287", 
      "inputs": [[44, 0, 0], [45, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->3_[5,5]_initialConvs_0_Ord2_angular_(1,1,3,4)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add269", 
      "inputs": [[46, 0, 0], [47, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add125", 
      "inputs": [[42, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "cos", 
      "name": "cos107", 
      "inputs": [[49, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like107", 
      "inputs": [[44, 0, 0]]
    }, 
    {
      "op": "broadcast_lesser", 
      "name": "broadcast_lesser107", 
      "inputs": [[44, 0, 0], [51, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad431", 
      "inputs": [[52, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul447", 
      "inputs": [[50, 0, 0], [53, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->3_[5,5]_initialConvs_0_Ord2_radial_(1,1,3,4)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul286", 
      "inputs": [[44, 0, 0], [55, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->3_[5,5]_initialConvs_0_Ord2_radial_(1,1,3,4)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add268", 
      "inputs": [[56, 0, 0], [57, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar271", 
      "attrs": {"scalar": "100"}, 
      "inputs": [[58, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh161", 
      "inputs": [[59, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul161", 
      "inputs": [[58, 0, 0], [60, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul449", 
      "inputs": [[54, 0, 0], [61, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "sort_ins1_out3_Re_assm_[5,5]_initialConvs_0", 
      "attrs": {
        "dim": "1", 
        "num_args": "1"
      }, 
      "inputs": [[62, 0, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like53", 
      "inputs": [[13, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "sort_ins1_out1_Im_assm_[5,5]_initialConvs_0", 
      "attrs": {
        "dim": "1", 
        "num_args": "1"
      }, 
      "inputs": [[64, 0, 0]]
    }, 
    {
      "op": "sin", 
      "name": "sin106", 
      "inputs": [[25, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul442", 
      "inputs": [[66, 0, 0], [29, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul444", 
      "inputs": [[67, 0, 0], [37, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "sort_ins1_out2_Im_assm_[5,5]_initialConvs_0", 
      "attrs": {
        "dim": "1", 
        "num_args": "1"
      }, 
      "inputs": [[68, 0, 0]]
    }, 
    {
      "op": "sin", 
      "name": "sin107", 
      "inputs": [[49, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul446", 
      "inputs": [[70, 0, 0], [53, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul448", 
      "inputs": [[71, 0, 0], [61, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "sort_ins1_out3_Im_assm_[5,5]_initialConvs_0", 
      "attrs": {
        "dim": "1", 
        "num_args": "1"
      }, 
      "inputs": [[72, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "assembledFilter_in1_out3_assm_[5,5]_initialConvs_0", 
      "attrs": {
        "dim": "0", 
        "num_args": "6"
      }, 
      "inputs": [[14, 0, 0], [39, 0, 0], [63, 0, 0], [65, 0, 0], [69, 0, 0], [73, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "conv_[5,5]_initialConvs_0", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(5, 5)", 
        "no_bias": "1", 
        "num_filter": "24", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[3, 0, 0], [74, 0, 0]]
    }, 
    {
      "op": "square", 
      "name": "square36", 
      "inputs": [[75, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "split18", 
      "attrs": {
        "axis": "1", 
        "num_outputs": "2"
      }, 
      "inputs": [[76, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add126", 
      "inputs": [[77, 0, 0], [77, 1, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar55", 
      "attrs": {"scalar": "2e-05"}, 
      "inputs": [[78, 0, 0]]
    }, 
    {
      "op": "sqrt", 
      "name": "sqrt36", 
      "inputs": [[79, 0, 0]]
    }, 
    {
      "op": "square", 
      "name": "square37", 
      "inputs": [[80, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar57", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[81, 0, 0]]
    }, 
    {
      "op": "sqrt", 
      "name": "sqrt37", 
      "inputs": [[82, 0, 0]]
    }, 
    {
      "op": "elemwise_div", 
      "name": "_div36", 
      "inputs": [[80, 0, 0], [83, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "initialConvs_0_(1,1,12,1)_mag_weight", 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu18", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1"
      }, 
      "inputs": [[85, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar56", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[86, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul288", 
      "inputs": [[84, 0, 0], [87, 0, 0]]
    }, 
    {
      "op": "elemwise_div", 
      "name": "_div37", 
      "inputs": [[88, 0, 0], [80, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile342", 
      "attrs": {"reps": "(1, 2, 1, 1)"}, 
      "inputs": [[89, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul450", 
      "inputs": [[75, 0, 0], [90, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad19", 
      "attrs": {
        "mode": "edge", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[91, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "radius_3x3", 
      "inputs": []
    }, 
    {
      "op": "tile", 
      "name": "tile343", 
      "attrs": {"reps": "(6, 4, 1, 1)"}, 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad432", 
      "inputs": [[94, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->1_[3,3]_initialConvs_1_Ord0_radial_(1,1,4,6)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul289", 
      "inputs": [[95, 0, 0], [96, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->1_[3,3]_initialConvs_1_Ord0_radial_(1,1,4,6)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add270", 
      "inputs": [[97, 0, 0], [98, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar273", 
      "attrs": {"scalar": "100"}, 
      "inputs": [[99, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh162", 
      "inputs": [[100, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul162", 
      "inputs": [[99, 0, 0], [101, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "theta_3x3", 
      "inputs": []
    }, 
    {
      "op": "tile", 
      "name": "tile350", 
      "attrs": {"reps": "(6, 4, 1, 1)"}, 
      "inputs": [[103, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad441", 
      "inputs": [[104, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar279", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[105, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile349", 
      "attrs": {"reps": "(6, 4, 1, 1)"}, 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad440", 
      "inputs": [[107, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_2->1_[3,3]_initialConvs_1_Ord1_angular_(1,1,4,6)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul295", 
      "inputs": [[108, 0, 0], [109, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_2->1_[3,3]_initialConvs_1_Ord1_angular_(1,1,4,6)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add276", 
      "inputs": [[110, 0, 0], [111, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add129", 
      "inputs": [[106, 0, 0], [112, 0, 0]]
    }, 
    {
      "op": "cos", 
      "name": "cos110", 
      "inputs": [[113, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like110", 
      "inputs": [[108, 0, 0]]
    }, 
    {
      "op": "broadcast_lesser", 
      "name": "broadcast_lesser110", 
      "inputs": [[108, 0, 0], [115, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad442", 
      "inputs": [[116, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul460", 
      "inputs": [[114, 0, 0], [117, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_2->1_[3,3]_initialConvs_1_Ord1_radial_(1,1,4,6)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul294", 
      "inputs": [[108, 0, 0], [119, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_2->1_[3,3]_initialConvs_1_Ord1_radial_(1,1,4,6)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add275", 
      "inputs": [[120, 0, 0], [121, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar278", 
      "attrs": {"scalar": "100"}, 
      "inputs": [[122, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh165", 
      "inputs": [[123, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul165", 
      "inputs": [[122, 0, 0], [124, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul462", 
      "inputs": [[118, 0, 0], [125, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile356", 
      "attrs": {"reps": "(6, 4, 1, 1)"}, 
      "inputs": [[103, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad449", 
      "inputs": [[127, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar284", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[128, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile355", 
      "attrs": {"reps": "(6, 4, 1, 1)"}, 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad448", 
      "inputs": [[130, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_3->1_[3,3]_initialConvs_1_Ord2_angular_(1,1,4,6)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul300", 
      "inputs": [[131, 0, 0], [132, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_3->1_[3,3]_initialConvs_1_Ord2_angular_(1,1,4,6)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add281", 
      "inputs": [[133, 0, 0], [134, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add131", 
      "inputs": [[129, 0, 0], [135, 0, 0]]
    }, 
    {
      "op": "cos", 
      "name": "cos112", 
      "inputs": [[136, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like112", 
      "inputs": [[131, 0, 0]]
    }, 
    {
      "op": "broadcast_lesser", 
      "name": "broadcast_lesser112", 
      "inputs": [[131, 0, 0], [138, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad450", 
      "inputs": [[139, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul468", 
      "inputs": [[137, 0, 0], [140, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_3->1_[3,3]_initialConvs_1_Ord2_radial_(1,1,4,6)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul299", 
      "inputs": [[131, 0, 0], [142, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_3->1_[3,3]_initialConvs_1_Ord2_radial_(1,1,4,6)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add280", 
      "inputs": [[143, 0, 0], [144, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar283", 
      "attrs": {"scalar": "100"}, 
      "inputs": [[145, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh168", 
      "inputs": [[146, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul168", 
      "inputs": [[145, 0, 0], [147, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul470", 
      "inputs": [[141, 0, 0], [148, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "sort_ins3_out1_Re_assm_[3,3]_initialConvs_1", 
      "attrs": {
        "dim": "1", 
        "num_args": "3"
      }, 
      "inputs": [[102, 0, 0], [126, 0, 0], [149, 0, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like54", 
      "inputs": [[102, 0, 0]]
    }, 
    {
      "op": "sin", 
      "name": "sin110", 
      "inputs": [[113, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul459", 
      "inputs": [[152, 0, 0], [117, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul461", 
      "inputs": [[153, 0, 0], [125, 0, 0]]
    }, 
    {
      "op": "negative", 
      "name": "negative105", 
      "inputs": [[154, 0, 0]]
    }, 
    {
      "op": "sin", 
      "name": "sin112", 
      "inputs": [[136, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul467", 
      "inputs": [[156, 0, 0], [140, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul469", 
      "inputs": [[157, 0, 0], [148, 0, 0]]
    }, 
    {
      "op": "negative", 
      "name": "negative106", 
      "inputs": [[158, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "sort_ins3_out1_Im_assm_[3,3]_initialConvs_1", 
      "attrs": {
        "dim": "1", 
        "num_args": "3"
      }, 
      "inputs": [[151, 0, 0], [155, 0, 0], [159, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "ReIm_ins3_out1_assm_[3,3]_initialConvs_1", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[150, 0, 0], [160, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile346", 
      "attrs": {"reps": "(10, 4, 1, 1)"}, 
      "inputs": [[103, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad435", 
      "inputs": [[162, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar275", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[163, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile345", 
      "attrs": {"reps": "(10, 4, 1, 1)"}, 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad434", 
      "inputs": [[165, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->2_[3,3]_initialConvs_1_Ord1_angular_(1,1,4,10)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul291", 
      "inputs": [[166, 0, 0], [167, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->2_[3,3]_initialConvs_1_Ord1_angular_(1,1,4,10)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add272", 
      "inputs": [[168, 0, 0], [169, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add127", 
      "inputs": [[164, 0, 0], [170, 0, 0]]
    }, 
    {
      "op": "cos", 
      "name": "cos108", 
      "inputs": [[171, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like108", 
      "inputs": [[166, 0, 0]]
    }, 
    {
      "op": "broadcast_lesser", 
      "name": "broadcast_lesser108", 
      "inputs": [[166, 0, 0], [173, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad436", 
      "inputs": [[174, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul452", 
      "inputs": [[172, 0, 0], [175, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->2_[3,3]_initialConvs_1_Ord1_radial_(1,1,4,10)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul290", 
      "inputs": [[166, 0, 0], [177, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->2_[3,3]_initialConvs_1_Ord1_radial_(1,1,4,10)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add271", 
      "inputs": [[178, 0, 0], [179, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar274", 
      "attrs": {"scalar": "100"}, 
      "inputs": [[180, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh163", 
      "inputs": [[181, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul163", 
      "inputs": [[180, 0, 0], [182, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul454", 
      "inputs": [[176, 0, 0], [183, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile351", 
      "attrs": {"reps": "(10, 4, 1, 1)"}, 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad443", 
      "inputs": [[185, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_2->2_[3,3]_initialConvs_1_Ord0_radial_(1,1,4,10)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul296", 
      "inputs": [[186, 0, 0], [187, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_2->2_[3,3]_initialConvs_1_Ord0_radial_(1,1,4,10)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add277", 
      "inputs": [[188, 0, 0], [189, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar280", 
      "attrs": {"scalar": "100"}, 
      "inputs": [[190, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh166", 
      "inputs": [[191, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul166", 
      "inputs": [[190, 0, 0], [192, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile358", 
      "attrs": {"reps": "(10, 4, 1, 1)"}, 
      "inputs": [[103, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad452", 
      "inputs": [[194, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar286", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[195, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile357", 
      "attrs": {"reps": "(10, 4, 1, 1)"}, 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad451", 
      "inputs": [[197, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_3->2_[3,3]_initialConvs_1_Ord1_angular_(1,1,4,10)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul302", 
      "inputs": [[198, 0, 0], [199, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_3->2_[3,3]_initialConvs_1_Ord1_angular_(1,1,4,10)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add283", 
      "inputs": [[200, 0, 0], [201, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add132", 
      "inputs": [[196, 0, 0], [202, 0, 0]]
    }, 
    {
      "op": "cos", 
      "name": "cos113", 
      "inputs": [[203, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like113", 
      "inputs": [[198, 0, 0]]
    }, 
    {
      "op": "broadcast_lesser", 
      "name": "broadcast_lesser113", 
      "inputs": [[198, 0, 0], [205, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad453", 
      "inputs": [[206, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul472", 
      "inputs": [[204, 0, 0], [207, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_3->2_[3,3]_initialConvs_1_Ord1_radial_(1,1,4,10)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul301", 
      "inputs": [[198, 0, 0], [209, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_3->2_[3,3]_initialConvs_1_Ord1_radial_(1,1,4,10)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add282", 
      "inputs": [[210, 0, 0], [211, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar285", 
      "attrs": {"scalar": "100"}, 
      "inputs": [[212, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh169", 
      "inputs": [[213, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul169", 
      "inputs": [[212, 0, 0], [214, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul474", 
      "inputs": [[208, 0, 0], [215, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "sort_ins3_out2_Re_assm_[3,3]_initialConvs_1", 
      "attrs": {
        "dim": "1", 
        "num_args": "3"
      }, 
      "inputs": [[184, 0, 0], [193, 0, 0], [216, 0, 0]]
    }, 
    {
      "op": "sin", 
      "name": "sin108", 
      "inputs": [[171, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul451", 
      "inputs": [[218, 0, 0], [175, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul453", 
      "inputs": [[219, 0, 0], [183, 0, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like55", 
      "inputs": [[193, 0, 0]]
    }, 
    {
      "op": "sin", 
      "name": "sin113", 
      "inputs": [[203, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul471", 
      "inputs": [[222, 0, 0], [207, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul473", 
      "inputs": [[223, 0, 0], [215, 0, 0]]
    }, 
    {
      "op": "negative", 
      "name": "negative108", 
      "inputs": [[224, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "sort_ins3_out2_Im_assm_[3,3]_initialConvs_1", 
      "attrs": {
        "dim": "1", 
        "num_args": "3"
      }, 
      "inputs": [[220, 0, 0], [221, 0, 0], [225, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "ReIm_ins3_out2_assm_[3,3]_initialConvs_1", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[217, 0, 0], [226, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile348", 
      "attrs": {"reps": "(5, 4, 1, 1)"}, 
      "inputs": [[103, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad438", 
      "inputs": [[228, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar277", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[229, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile347", 
      "attrs": {"reps": "(5, 4, 1, 1)"}, 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad437", 
      "inputs": [[231, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->3_[3,3]_initialConvs_1_Ord2_angular_(1,1,4,5)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul293", 
      "inputs": [[232, 0, 0], [233, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->3_[3,3]_initialConvs_1_Ord2_angular_(1,1,4,5)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add274", 
      "inputs": [[234, 0, 0], [235, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add128", 
      "inputs": [[230, 0, 0], [236, 0, 0]]
    }, 
    {
      "op": "cos", 
      "name": "cos109", 
      "inputs": [[237, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like109", 
      "inputs": [[232, 0, 0]]
    }, 
    {
      "op": "broadcast_lesser", 
      "name": "broadcast_lesser109", 
      "inputs": [[232, 0, 0], [239, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad439", 
      "inputs": [[240, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul456", 
      "inputs": [[238, 0, 0], [241, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->3_[3,3]_initialConvs_1_Ord2_radial_(1,1,4,5)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul292", 
      "inputs": [[232, 0, 0], [243, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->3_[3,3]_initialConvs_1_Ord2_radial_(1,1,4,5)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add273", 
      "inputs": [[244, 0, 0], [245, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar276", 
      "attrs": {"scalar": "100"}, 
      "inputs": [[246, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh164", 
      "inputs": [[247, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul164", 
      "inputs": [[246, 0, 0], [248, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul458", 
      "inputs": [[242, 0, 0], [249, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile354", 
      "attrs": {"reps": "(5, 4, 1, 1)"}, 
      "inputs": [[103, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad446", 
      "inputs": [[251, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar282", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[252, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile353", 
      "attrs": {"reps": "(5, 4, 1, 1)"}, 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad445", 
      "inputs": [[254, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_2->3_[3,3]_initialConvs_1_Ord1_angular_(1,1,4,5)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul298", 
      "inputs": [[255, 0, 0], [256, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_2->3_[3,3]_initialConvs_1_Ord1_angular_(1,1,4,5)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add279", 
      "inputs": [[257, 0, 0], [258, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add130", 
      "inputs": [[253, 0, 0], [259, 0, 0]]
    }, 
    {
      "op": "cos", 
      "name": "cos111", 
      "inputs": [[260, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like111", 
      "inputs": [[255, 0, 0]]
    }, 
    {
      "op": "broadcast_lesser", 
      "name": "broadcast_lesser111", 
      "inputs": [[255, 0, 0], [262, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad447", 
      "inputs": [[263, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul464", 
      "inputs": [[261, 0, 0], [264, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_2->3_[3,3]_initialConvs_1_Ord1_radial_(1,1,4,5)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul297", 
      "inputs": [[255, 0, 0], [266, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_2->3_[3,3]_initialConvs_1_Ord1_radial_(1,1,4,5)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add278", 
      "inputs": [[267, 0, 0], [268, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar281", 
      "attrs": {"scalar": "100"}, 
      "inputs": [[269, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh167", 
      "inputs": [[270, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul167", 
      "inputs": [[269, 0, 0], [271, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul466", 
      "inputs": [[265, 0, 0], [272, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile359", 
      "attrs": {"reps": "(5, 4, 1, 1)"}, 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad454", 
      "inputs": [[274, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_3->3_[3,3]_initialConvs_1_Ord0_radial_(1,1,4,5)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul303", 
      "inputs": [[275, 0, 0], [276, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_3->3_[3,3]_initialConvs_1_Ord0_radial_(1,1,4,5)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add284", 
      "inputs": [[277, 0, 0], [278, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar287", 
      "attrs": {"scalar": "100"}, 
      "inputs": [[279, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh170", 
      "inputs": [[280, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul170", 
      "inputs": [[279, 0, 0], [281, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "sort_ins3_out3_Re_assm_[3,3]_initialConvs_1", 
      "attrs": {
        "dim": "1", 
        "num_args": "3"
      }, 
      "inputs": [[250, 0, 0], [273, 0, 0], [282, 0, 0]]
    }, 
    {
      "op": "sin", 
      "name": "sin109", 
      "inputs": [[237, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul455", 
      "inputs": [[284, 0, 0], [241, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul457", 
      "inputs": [[285, 0, 0], [249, 0, 0]]
    }, 
    {
      "op": "sin", 
      "name": "sin111", 
      "inputs": [[260, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul463", 
      "inputs": [[287, 0, 0], [264, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul465", 
      "inputs": [[288, 0, 0], [272, 0, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like56", 
      "inputs": [[282, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "sort_ins3_out3_Im_assm_[3,3]_initialConvs_1", 
      "attrs": {
        "dim": "1", 
        "num_args": "3"
      }, 
      "inputs": [[286, 0, 0], [289, 0, 0], [290, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "ReIm_ins3_out3_assm_[3,3]_initialConvs_1", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[283, 0, 0], [291, 0, 0]]
    }, 
    {
      "op": "negative", 
      "name": "negative107", 
      "inputs": [[160, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "ImRe_ins3_out1_assm_[3,3]_initialConvs_1", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[293, 0, 0], [150, 0, 0]]
    }, 
    {
      "op": "negative", 
      "name": "negative109", 
      "inputs": [[226, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "ImRe_ins3_out2_assm_[3,3]_initialConvs_1", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[295, 0, 0], [217, 0, 0]]
    }, 
    {
      "op": "negative", 
      "name": "negative110", 
      "inputs": [[291, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "ImRe_ins3_out3_assm_[3,3]_initialConvs_1", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[297, 0, 0], [283, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "assembledFilter_in3_out3_assm_[3,3]_initialConvs_1", 
      "attrs": {
        "dim": "0", 
        "num_args": "6"
      }, 
      "inputs": [[161, 0, 0], [227, 0, 0], [292, 0, 0], [294, 0, 0], [296, 0, 0], [298, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "conv_[3,3]_initialConvs_1", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "no_bias": "1", 
        "num_filter": "42", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[92, 0, 0], [299, 0, 0]]
    }, 
    {
      "op": "square", 
      "name": "square38", 
      "inputs": [[300, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "split19", 
      "attrs": {
        "axis": "1", 
        "num_outputs": "2"
      }, 
      "inputs": [[301, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add133", 
      "inputs": [[302, 0, 0], [302, 1, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar58", 
      "attrs": {"scalar": "2e-05"}, 
      "inputs": [[303, 0, 0]]
    }, 
    {
      "op": "sqrt", 
      "name": "sqrt38", 
      "inputs": [[304, 0, 0]]
    }, 
    {
      "op": "square", 
      "name": "square39", 
      "inputs": [[305, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar60", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[306, 0, 0]]
    }, 
    {
      "op": "sqrt", 
      "name": "sqrt39", 
      "inputs": [[307, 0, 0]]
    }, 
    {
      "op": "elemwise_div", 
      "name": "_div38", 
      "inputs": [[305, 0, 0], [308, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "initialConvs_1_(1,1,21,1)_mag_weight", 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "leakyrelu19", 
      "attrs": {
        "act_type": "elu", 
        "slope": "1"
      }, 
      "inputs": [[310, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "_plusscalar59", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[311, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul304", 
      "inputs": [[309, 0, 0], [312, 0, 0]]
    }, 
    {
      "op": "elemwise_div", 
      "name": "_div39", 
      "inputs": [[313, 0, 0], [305, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile361", 
      "attrs": {"reps": "(1, 2, 1, 1)"}, 
      "inputs": [[314, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul475", 
      "inputs": [[300, 0, 0], [315, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "pad20", 
      "attrs": {
        "mode": "edge", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[316, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile362", 
      "attrs": {"reps": "(6, 6, 1, 1)"}, 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad456", 
      "inputs": [[318, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->1_[3,3]_3_1_s44_Ord0_radial_(1,1,6,6)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul305", 
      "inputs": [[319, 0, 0], [320, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->1_[3,3]_3_1_s44_Ord0_radial_(1,1,6,6)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add285", 
      "inputs": [[321, 0, 0], [322, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar288", 
      "attrs": {"scalar": "100"}, 
      "inputs": [[323, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh171", 
      "inputs": [[324, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul171", 
      "inputs": [[323, 0, 0], [325, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile369", 
      "attrs": {"reps": "(6, 10, 1, 1)"}, 
      "inputs": [[103, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad465", 
      "inputs": [[327, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar294", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[328, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile368", 
      "attrs": {"reps": "(6, 10, 1, 1)"}, 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad464", 
      "inputs": [[330, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_2->1_[3,3]_3_1_s44_Ord1_angular_(1,1,10,6)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul311", 
      "inputs": [[331, 0, 0], [332, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_2->1_[3,3]_3_1_s44_Ord1_angular_(1,1,10,6)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add291", 
      "inputs": [[333, 0, 0], [334, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add136", 
      "inputs": [[329, 0, 0], [335, 0, 0]]
    }, 
    {
      "op": "cos", 
      "name": "cos116", 
      "inputs": [[336, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like116", 
      "inputs": [[331, 0, 0]]
    }, 
    {
      "op": "broadcast_lesser", 
      "name": "broadcast_lesser116", 
      "inputs": [[331, 0, 0], [338, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad466", 
      "inputs": [[339, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul485", 
      "inputs": [[337, 0, 0], [340, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_2->1_[3,3]_3_1_s44_Ord1_radial_(1,1,10,6)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul310", 
      "inputs": [[331, 0, 0], [342, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_2->1_[3,3]_3_1_s44_Ord1_radial_(1,1,10,6)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add290", 
      "inputs": [[343, 0, 0], [344, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar293", 
      "attrs": {"scalar": "100"}, 
      "inputs": [[345, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh174", 
      "inputs": [[346, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul174", 
      "inputs": [[345, 0, 0], [347, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul487", 
      "inputs": [[341, 0, 0], [348, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile375", 
      "attrs": {"reps": "(6, 5, 1, 1)"}, 
      "inputs": [[103, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad473", 
      "inputs": [[350, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar299", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[351, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile374", 
      "attrs": {"reps": "(6, 5, 1, 1)"}, 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad472", 
      "inputs": [[353, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_3->1_[3,3]_3_1_s44_Ord2_angular_(1,1,5,6)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul316", 
      "inputs": [[354, 0, 0], [355, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_3->1_[3,3]_3_1_s44_Ord2_angular_(1,1,5,6)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add296", 
      "inputs": [[356, 0, 0], [357, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add138", 
      "inputs": [[352, 0, 0], [358, 0, 0]]
    }, 
    {
      "op": "cos", 
      "name": "cos118", 
      "inputs": [[359, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like118", 
      "inputs": [[354, 0, 0]]
    }, 
    {
      "op": "broadcast_lesser", 
      "name": "broadcast_lesser118", 
      "inputs": [[354, 0, 0], [361, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad474", 
      "inputs": [[362, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul493", 
      "inputs": [[360, 0, 0], [363, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_3->1_[3,3]_3_1_s44_Ord2_radial_(1,1,5,6)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul315", 
      "inputs": [[354, 0, 0], [365, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_3->1_[3,3]_3_1_s44_Ord2_radial_(1,1,5,6)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add295", 
      "inputs": [[366, 0, 0], [367, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar298", 
      "attrs": {"scalar": "100"}, 
      "inputs": [[368, 0, 0]]
    }, 
    {
      "op": "tanh", 
      "name": "tanh177", 
      "inputs": [[369, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "_mul177", 
      "inputs": [[368, 0, 0], [370, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul495", 
      "inputs": [[364, 0, 0], [371, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "sort_ins3_out1_Re_assm_[3,3]_3_1_s44", 
      "attrs": {
        "dim": "1", 
        "num_args": "3"
      }, 
      "inputs": [[326, 0, 0], [349, 0, 0], [372, 0, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "zeros_like57", 
      "inputs": [[326, 0, 0]]
    }, 
    {
      "op": "sin", 
      "name": "sin116", 
      "inputs": [[336, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul484", 
      "inputs": [[375, 0, 0], [340, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul486", 
      "inputs": [[376, 0, 0], [348, 0, 0]]
    }, 
    {
      "op": "negative", 
      "name": "negative111", 
      "inputs": [[377, 0, 0]]
    }, 
    {
      "op": "sin", 
      "name": "sin118", 
      "inputs": [[359, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul492", 
      "inputs": [[379, 0, 0], [363, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul494", 
      "inputs": [[380, 0, 0], [371, 0, 0]]
    }, 
    {
      "op": "negative", 
      "name": "negative112", 
      "inputs": [[381, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "sort_ins3_out1_Im_assm_[3,3]_3_1_s44", 
      "attrs": {
        "dim": "1", 
        "num_args": "3"
      }, 
      "inputs": [[374, 0, 0], [378, 0, 0], [382, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "ReIm_ins3_out1_assm_[3,3]_3_1_s44", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[373, 0, 0], [383, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile365", 
      "attrs": {"reps": "(10, 6, 1, 1)"}, 
      "inputs": [[103, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad459", 
      "inputs": [[385, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar290", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[386, 0, 0]]
    }, 
    {
      "op": "tile", 
      "name": "tile364", 
      "attrs": {"reps": "(10, 6, 1, 1)"}, 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad458", 
      "inputs": [[388, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->2_[3,3]_3_1_s44_Ord1_angular_(1,1,6,10)_weight", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "broadcast_mul307", 
      "inputs": [[389, 0, 0], [390, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->2_[3,3]_3_1_s44_Ord1_angular_(1,1,6,10)_bias", 
      "inputs": []
    }, 
    {
      "op": "broadcast_add", 
      "name": "broadcast_add287", 
      "inputs": [[391, 0, 0], [392, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add134", 
      "inputs": [[387, 0, 0], [393, 0, 0]]
    }, 
    {
      "op": "cos", 
      "name": "cos114", 
      "inputs": [[394, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like114", 
      "inputs": [[389, 0, 0]]
    }, 
    {
      "op": "broadcast_lesser", 
      "name": "broadcast_lesser114", 
      "inputs": [[389, 0, 0], [396, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad460", 
      "inputs": [[397, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "elemwise_mul477", 
      "inputs": [[395, 0, 0], [398, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "param_1->2_[3,3]_3_1_s44_Ord1_radial_(1,1,6,10)_weight", 
      "inputs": []
